var kcbData = {
	"city": "",
	"tPlan": [{
		"city": "cs",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "dl",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["升初一时态综合", "升初一形容词副词比较级", "升初一音标", "升初一冠词数词", "升初一名词", "升初一代词", "升初一完形填空", "升初一阅读理解",
						"升初一短文填空", "升初一写作"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["七下M1-2复习", "七下M3-4复习", "七下M5-6复习", "七下M7-8复习", "七下M9-10复习", "七下M11-12复习", "八上M1预习",
						"初二上册预习Module 2", "初二上册预习Module 3", "初二上册预习Module 4"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["升初三M1-2复习", "升初三M3-4复习", "升初三M5-6复习", "升初三M7-8复习", "升初三M9-10复习", "初三上M1part1", "初三上M1part2",
						"初三上M2part1", "初三上M2part2", "初三上M3part1"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["单元一重点单词短语句型精讲", "单元二重点单词短语句型精讲", "单元三重点单词短语句型精讲", "单元四重点单词短语句型精讲", "单元五重点单词短语句型精讲",
						"单元六重点单词短语句型精讲", "时态主被动结构及相关用法的讲解", "句式：倒装，强调，省略，感叹，祈使", "高考高频动词及动词短语辨析精讲", "常见词根词缀及其意义"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["单元一重点单词短语句型精讲", "单元二重点单词短语句型精讲", "单元三重点单词短语句型精讲", "单元四重点单词短语句型精讲", "单元五重点单词短语句型精讲",
						"单元六重点单词短语句型精讲", "升高二：定语从句", "升高二：状语从句", "升高二：名词性从句", "非谓语动词（不定式）精讲"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：被动语态", "语法专题：非谓语动词（1）",
						"语法专题：非谓语动词（1）", "语法专题：高中情态动词精讲（1）", "语法专题：高中情态动词精讲（2）", "语法专题：虚拟语气"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "fz",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "物理",
					"detail": ["压力、压强的复习", "浮力复习", "简单机械、机械效率复习", "温度及物态变化", "物态变化复习", "内能、比热容、热机", "热机效率及能量守恒定律", "热学复习",
						"电荷、电流与电流测量", "认识串并联电路及其电流的关系"
					]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "匀变速直线运动的认识", "匀变速直线运动的规律", "自由落体运动", "重力弹力摩擦力", "力的合成", "力的分解", "力的静态平衡",
						"牛顿运动定律的基本认识", "牛二的简单应用"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["匀变速直线运动", "力的合成分解、静态平衡", "力的动态平衡", "牛顿运动定律的认识", "牛顿运动定律的应用", "必修一实验专题", "曲线运动与速度合成分解", "平抛运动",
						"圆周运动", "万有引力与天体运动"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["匀变速直线运动的规律", "自由落体运动与追击相遇问题", "三大基础力，力的合成与分解", "受力分析及其方法", "牛顿三大运动定律", "功、功率与动能定理",
						"机械能守恒与能量守恒", "运动的合成与分解", "平抛运动", "圆周运动"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "gy",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "hf",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["升初一时态综合", "升初一形容词副词比较级", "升初一音标", "升初一冠词数词", "升初一名词", "升初一代词", "升初一完形填空", "升初一阅读理解",
						"升初一短文填空", "升初一写作"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["七下M1-2复习", "七下M3-4复习", "七下M5-6复习", "七下M7-8复习", "七下M9-10复习", "七下M11-12复习", "八上M1预习",
						"初二上册预习Module 2", "初二上册预习Module 3", "初二上册预习Module 4"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"光的直线传播和反射", "平面镜成像"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["升初三M1-2复习", "升初三M3-4复习", "升初三M5-6复习", "升初三M7-8复习", "升初三M9-10复习", "初三上M1part1", "初三上M1part2",
						"初三上M2part1", "初三上M2part2", "初三上M3part1"
					]
				}, {
					"subject": "物理",
					"detail": ["压力、压强的复习", "浮力复习", "简单机械、机械效率复习", "温度及物态变化", "物态变化复习", "内能、比热容、热机", "热机效率及能量守恒定律", "热学复习",
						"电荷、电流与电流测量", "认识串并联电路及其电流的关系"
					]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "hhht",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["升初一时态综合", "升初一形容词副词比较级", "升初一音标", "升初一冠词数词", "升初一名词", "升初一代词", "升初一完形填空", "升初一阅读理解",
						"升初一短文填空", "升初一写作"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["七下M1-2复习", "七下M3-4复习", "七下M5-6复习", "七下M7-8复习", "七下M9-10复习", "七下M11-12复习", "八上M1预习",
						"初二上册预习Module 2", "初二上册预习Module 3", "初二上册预习Module 4"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["升初三M1-2复习", "升初三M3-4复习", "升初三M5-6复习", "升初三M7-8复习", "升初三M9-10复习", "初三上M1part1", "初三上M1part2",
						"初三上M2part1", "初三上M2part2", "初三上M3part1"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "km",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"光的直线传播和反射", "平面镜成像"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "物理",
					"detail": ["分压力、压强的复习", "浮力复习", "简单机械、机械效率复习", "温度及物态变化", "物态变化复习", "内能、比热容、热机", "热机效率及能量守恒定律", "热学复习",
						"电荷、电流与电流测量", "认识串并联电路及其电流的关系"
					]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "nc",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "物理",
					"detail": ["物理世界与时间长度的测量", "认识速度与速度的测量", "体积的测量", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "声复习", "认识光和光的直线传播",
						"光的反射", "平面镜成像"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "物理",
					"detail": ["力与机械复习", "运动与力复习", "压强复习", "浮力复习", "粒子与宇宙和八下复习", "功", "功率", "机械效率", "动能、势能、机械能", "机械功与机械能学复习"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "匀变速直线运动的认识", "匀变速直线运动的规律", "自由落体运动", "重力弹力摩擦力", "力的合成", "力的分解", "力的静态平衡",
						"牛顿运动定律的基本认识", "牛二的简单应用"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["匀变速直线运动", "力的合成分解、静态平衡", "力的动态平衡", "牛顿运动定律的认识", "牛顿运动定律的应用", "必修一实验专题", "曲线运动与速度合成分解", "平抛运动",
						"圆周运动", "万有引力与天体运动"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["匀变速直线运动的规律", "自由落体运动与追击相遇问题", "三大基础力，力的合成与分解", "受力分析及其方法", "牛顿三大运动定律", "功、功率与动能定理",
						"机械能守恒与能量守恒", "运动的合成与分解", "平抛运动", "圆周运动"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "qd",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["克、千克、吨的认识", "两、三位数初一一位数（一）", "对称", "两三位数除以一位数（二）", "加减除的混合运算", "加减乘除的混合运算1", "位置与变换",
						"两位数除以两位数", "加减乘除的混合运算2", "长方形和正方形的面积"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["用字母表示数", "乘法运算定律", "前两章总复习", "小数的意义与性质", "小数的加法和减法", "小数的加减混合运算", "前四章总复习", "角与三角", "小数的乘法",
						"小数的除法"
					]
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					]
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["分数加减法（二）", "长方体和正方体", "分数的乘法", "分数的加减乘混合运算", "前三章整体复习", "可能性", "分数的除法", "比-1", "比-2", "方向与位置"]
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A ", "六年级上册Unit1-Part B "
					]
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", " 面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					]
				}, {
					"subject": "数学",
					"detail": ["分数的乘法", "分数的除法", "分数的应用", "比", "圆-1", "圆-2", "前三章综合复习", "分数的四则运算", "统计", "可能性"]
				}, {
					"subject": "英语",
					"detail": ["", "", "", "", "", "", "", "", "", ""]
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["升初一时态综合", "升初一形容词副词比较级", "升初一音标", "升初一冠词数词", "升初一名词", "升初一代词", "升初一完形填空", "升初一阅读理解",
						"升初一短文填空", "升初一写作"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["七下M1-2复习", "七下M3-4复习", "七下M5-6复习", "七下M7-8复习", "七下M9-10复习", "七下M11-12复习", "八上M1预习",
						"初二上册预习Module 2 My home town and my country", "初二上册预习Module 3 Sports",
						"初二上册预习Module 4 Planes, ships and trains"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}, {
					"subject": "化学",
					"detail": ["", "", "", "", "", "", "", "", "", ""]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						" 水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["升初三M1-2复习", "升初三M3-4复习", "升初三M5-6复习", "升初三M7-8复习", "升初三M9-10复习", "初三上M1part1", "初三上M1part2",
						"初三上M2part1", "初三上M2part2", "初三上M3part1"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["奇妙的化学", "体验化学探究", "运动的水分子", "分子的变化", "溶液", "原子的构成", "元素及物质组成", "我们周围的空气", "氧气", "物质的组成"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["钠", "氯", "物质的量1", "物质的量2", "溶液配制", "分散系与胶体", "物质的分类", "离子反应1", "离子反应2", "氧化还原1"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["盖斯定律", "原电池1", "原电池2", "电解池1", "电解池2", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数", "化学反应进行的方向"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "wh",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "zz",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "changshu",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					]
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A ",
						"五年级上册Unit1-Part B ", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					]
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", " 阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					]
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					]
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A ", "六年级上册Unit1-Part B "
					]
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["字词复习", "句型转换", "课内现代文预习——《春》", "课内现代文预习——《秋天的怀念》", "课内文言文预习——《世说新语》两则", "课内文言文预习——《论语十二章》",
						"课内名著预习——《朝花夕拾》", "现代文阅读——修辞手法区分及作用", "现代文阅读——概括文章主要内容", "古诗词鉴赏——情感分析"
					]
				}, {
					"subject": "数学",
					"detail": ["数的认识和运算", "式与方程、比和比例", "图形的认识与测量", "图形的运动与位置", "统计与概率", "探索与发现", "测试（前6讲）", "正负数和有理数",
						"有理数的加减法", "有理数的乘除法"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["复习——七下文言文（一）", "复习——七下文言文（二）", "复习——七下名著阅读", "预习——《三峡》", "预习——《<孟子>两章》", "预习——《红星照耀中国》",
						"现代文阅读——修辞手法的作用", "现代文阅读——人称的作用", "现代文阅读——记叙顺序及作用", "现代文阅读——人物描写"
					]
				}, {
					"subject": "数学",
					"detail": ["与三角形有关的线段", "与三角形有关的角", "多边形及其内角和", "全等三角形性质与判定（一）", "全等三角形判断（二）", "角的平分线的性质", "测试（前6讲）",
						"轴对称", "等腰三角形", "整式的乘法"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["一元二次方程的定义和解法", "实际问题与一元二次方程", "二次函数的定义及平移问题", "二次函数的图象及性质", "二次函数与一元二次方程", "实际问题与二次函数",
						"测试（前6讲）", "旋转", "圆的有关性质", "点和圆、直线和圆的位置关系"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["代数式変形", "一元二次方程与二次函数", "不等式", "集合概念及其表示", "集合之间的关系与运算", "函数的概念及表示", "测试（前6讲）", "函数的单调性",
						"函数的奇偶性", "指数函数"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["空间几何体", "空间几何体的表面积和体积", "平面", "点线面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质", "测试（前6讲）", "直线、平面垂直的判定",
						"直线、平面垂直的性质", "空间向量及其运算"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8复习", "升高二Unit9复习", "升高二Unit10复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						" unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合", "命题和充要条件", "函数的概念及其表示", "函数的性质", "指数函数", "对数函数与幂函数", "函数与方程", "导数的计算及几何意义",
						"导数在函数研究中的应用", "导数与函数的综合问题"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "yz",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					]
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A ",
						"五年级上册Unit1-Part B ", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					]
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", " 阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					]
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					]
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A ", "六年级上册Unit1-Part B "
					]
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["字词复习", "句型转换", "课内现代文预习——《春》", "课内现代文预习——《秋天的怀念》", "课内文言文预习——《世说新语》两则", "课内文言文预习——《论语十二章》",
						"课内名著预习——《朝花夕拾》", "现代文阅读——修辞手法区分及作用", "现代文阅读——概括文章主要内容", "古诗词鉴赏——情感分析"
					]
				}, {
					"subject": "数学",
					"detail": ["数的认识和运算", "式与方程、比和比例", "图形的认识与测量", "图形的运动与位置", "统计与概率", "探索与发现", "测试（前6讲）", "正负数和有理数",
						"有理数的加减法", "有理数的乘除法"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["复习——七下文言文（一）", "复习——七下文言文（二）", "复习——七下名著阅读", "预习——《三峡》", "预习——《<孟子>两章》", "预习——《红星照耀中国》",
						"现代文阅读——修辞手法的作用", "现代文阅读——人称的作用", "现代文阅读——记叙顺序及作用", "现代文阅读——人物描写"
					]
				}, {
					"subject": "数学",
					"detail": ["与三角形有关的线段", "与三角形有关的角", "多边形及其内角和", "全等三角形性质与判定（一）", "全等三角形判断（二）", "角的平分线的性质", "测试（前6讲）",
						"轴对称", "等腰三角形", "整式的乘法"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["一元二次方程的定义和解法", "实际问题与一元二次方程", "二次函数的定义及平移问题", "二次函数的图象及性质", "二次函数与一元二次方程", "实际问题与二次函数",
						"测试（前6讲）", "旋转", "圆的有关性质", "点和圆、直线和圆的位置关系"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["代数式変形", "一元二次方程与二次函数", "不等式", "集合概念及其表示", "集合之间的关系与运算", "函数的概念及表示", "测试（前6讲）", "函数的单调性",
						"函数的奇偶性", "指数函数"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["空间几何体", "空间几何体的表面积和体积", "平面", "点线面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质", "测试（前6讲）", "直线、平面垂直的判定",
						"直线、平面垂直的性质", "空间向量及其运算"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8复习", "升高二Unit9复习", "升高二Unit10复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						" unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合", "命题和充要条件", "函数的概念及其表示", "函数的性质", "指数函数", "对数函数与幂函数", "函数与方程", "导数的计算及几何意义",
						"导数在函数研究中的应用", "导数与函数的综合问题"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "wx",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					]
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A ",
						"五年级上册Unit1-Part B ", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					]
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", " 阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					]
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					]
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A ", "六年级上册Unit1-Part B "
					]
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["字词复习", "句型转换", "课内现代文预习——《春》", "课内现代文预习——《秋天的怀念》", "课内文言文预习——《世说新语》两则", "课内文言文预习——《论语十二章》",
						"课内名著预习——《朝花夕拾》", "现代文阅读——修辞手法区分及作用", "现代文阅读——概括文章主要内容", "古诗词鉴赏——情感分析"
					]
				}, {
					"subject": "数学",
					"detail": ["数的认识和运算", "式与方程、比和比例", "图形的认识与测量", "图形的运动与位置", "统计与概率", "探索与发现", "测试（前6讲）", "正负数和有理数",
						"有理数的加减法", "有理数的乘除法"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["复习——七下文言文（一）", "复习——七下文言文（二）", "复习——七下名著阅读", "预习——《三峡》", "预习——《<孟子>两章》", "预习——《红星照耀中国》",
						"现代文阅读——修辞手法的作用", "现代文阅读——人称的作用", "现代文阅读——记叙顺序及作用", "现代文阅读——人物描写"
					]
				}, {
					"subject": "数学",
					"detail": ["与三角形有关的线段", "与三角形有关的角", "多边形及其内角和", "全等三角形性质与判定（一）", "全等三角形判断（二）", "角的平分线的性质", "测试（前6讲）",
						"轴对称", "等腰三角形", "整式的乘法"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["一元二次方程的定义和解法", "实际问题与一元二次方程", "二次函数的定义及平移问题", "二次函数的图象及性质", "二次函数与一元二次方程", "实际问题与二次函数",
						"测试（前6讲）", "旋转", "圆的有关性质", "点和圆、直线和圆的位置关系"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["代数式変形", "一元二次方程与二次函数", "不等式", "集合概念及其表示", "集合之间的关系与运算", "函数的概念及表示", "测试（前6讲）", "函数的单调性",
						"函数的奇偶性", "指数函数"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["空间几何体", "空间几何体的表面积和体积", "平面", "点线面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质", "测试（前6讲）", "直线、平面垂直的判定",
						"直线、平面垂直的性质", "空间向量及其运算"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8复习", "升高二Unit9复习", "升高二Unit10复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						" unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合", "命题和充要条件", "函数的概念及其表示", "函数的性质", "指数函数", "对数函数与幂函数", "函数与方程", "导数的计算及几何意义",
						"导数在函数研究中的应用", "导数与函数的综合问题"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "suzhou",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					]
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A ",
						"五年级上册Unit1-Part B ", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					]
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", " 阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					]
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					]
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A ", "六年级上册Unit1-Part B "
					]
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["字词复习", "句型转换", "课内现代文预习——《春》", "课内现代文预习——《秋天的怀念》", "课内文言文预习——《世说新语》两则", "课内文言文预习——《论语十二章》",
						"课内名著预习——《朝花夕拾》", "现代文阅读——修辞手法区分及作用", "现代文阅读——概括文章主要内容", "古诗词鉴赏——情感分析"
					]
				}, {
					"subject": "数学",
					"detail": ["数的认识和运算", "式与方程、比和比例", "图形的认识与测量", "图形的运动与位置", "统计与概率", "探索与发现", "测试（前6讲）", "正负数和有理数",
						"有理数的加减法", "有理数的乘除法"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["复习——七下文言文（一）", "复习——七下文言文（二）", "复习——七下名著阅读", "预习——《三峡》", "预习——《<孟子>两章》", "预习——《红星照耀中国》",
						"现代文阅读——修辞手法的作用", "现代文阅读——人称的作用", "现代文阅读——记叙顺序及作用", "现代文阅读——人物描写"
					]
				}, {
					"subject": "数学",
					"detail": ["与三角形有关的线段", "与三角形有关的角", "多边形及其内角和", "全等三角形性质与判定（一）", "全等三角形判断（二）", "角的平分线的性质", "测试（前6讲）",
						"轴对称", "等腰三角形", "整式的乘法"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["一元二次方程的定义和解法", "实际问题与一元二次方程", "二次函数的定义及平移问题", "二次函数的图象及性质", "二次函数与一元二次方程", "实际问题与二次函数",
						"测试（前6讲）", "旋转", "圆的有关性质", "点和圆、直线和圆的位置关系"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["代数式変形", "一元二次方程与二次函数", "不等式", "集合概念及其表示", "集合之间的关系与运算", "函数的概念及表示", "测试（前6讲）", "函数的单调性",
						"函数的奇偶性", "指数函数"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["空间几何体", "空间几何体的表面积和体积", "平面", "点线面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质", "测试（前6讲）", "直线、平面垂直的判定",
						"直线、平面垂直的性质", "空间向量及其运算"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8复习", "升高二Unit9复习", "升高二Unit10复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						" unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合", "命题和充要条件", "函数的概念及其表示", "函数的性质", "指数函数", "对数函数与幂函数", "函数与方程", "导数的计算及几何意义",
						"导数在函数研究中的应用", "导数与函数的综合问题"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "cz",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					]
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A ",
						"五年级上册Unit1-Part B ", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					]
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", " 阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					]
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					]
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A ", "六年级上册Unit1-Part B "
					]
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["字词复习", "句型转换", "课内现代文预习——《春》", "课内现代文预习——《秋天的怀念》", "课内文言文预习——《世说新语》两则", "课内文言文预习——《论语十二章》",
						"课内名著预习——《朝花夕拾》", "现代文阅读——修辞手法区分及作用", "现代文阅读——概括文章主要内容", "古诗词鉴赏——情感分析"
					]
				}, {
					"subject": "数学",
					"detail": ["数的认识和运算", "式与方程、比和比例", "图形的认识与测量", "图形的运动与位置", "统计与概率", "探索与发现", "测试（前6讲）", "正负数和有理数",
						"有理数的加减法", "有理数的乘除法"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["复习——七下文言文（一）", "复习——七下文言文（二）", "复习——七下名著阅读", "预习——《三峡》", "预习——《<孟子>两章》", "预习——《红星照耀中国》",
						"现代文阅读——修辞手法的作用", "现代文阅读——人称的作用", "现代文阅读——记叙顺序及作用", "现代文阅读——人物描写"
					]
				}, {
					"subject": "数学",
					"detail": ["与三角形有关的线段", "与三角形有关的角", "多边形及其内角和", "全等三角形性质与判定（一）", "全等三角形判断（二）", "角的平分线的性质", "测试（前6讲）",
						"轴对称", "等腰三角形", "整式的乘法"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["一元二次方程的定义和解法", "实际问题与一元二次方程", "二次函数的定义及平移问题", "二次函数的图象及性质", "二次函数与一元二次方程", "实际问题与二次函数",
						"测试（前6讲）", "旋转", "圆的有关性质", "点和圆、直线和圆的位置关系"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["代数式変形", "一元二次方程与二次函数", "不等式", "集合概念及其表示", "集合之间的关系与运算", "函数的概念及表示", "测试（前6讲）", "函数的单调性",
						"函数的奇偶性", "指数函数"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["空间几何体", "空间几何体的表面积和体积", "平面", "点线面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质", "测试（前6讲）", "直线、平面垂直的判定",
						"直线、平面垂直的性质", "空间向量及其运算"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8复习", "升高二Unit9复习", "升高二Unit10复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						" unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合", "命题和充要条件", "函数的概念及其表示", "函数的性质", "指数函数", "对数函数与幂函数", "函数与方程", "导数的计算及几何意义",
						"导数在函数研究中的应用", "导数与函数的综合问题"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "nt",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					]
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A ",
						"五年级上册Unit1-Part B ", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					]
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", " 阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					]
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					]
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A ", "六年级上册Unit1-Part B "
					]
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["字词复习", "句型转换", "课内现代文预习——《春》", "课内现代文预习——《秋天的怀念》", "课内文言文预习——《世说新语》两则", "课内文言文预习——《论语十二章》",
						"课内名著预习——《朝花夕拾》", "现代文阅读——修辞手法区分及作用", "现代文阅读——概括文章主要内容", "古诗词鉴赏——情感分析"
					]
				}, {
					"subject": "数学",
					"detail": ["数的认识和运算", "式与方程、比和比例", "图形的认识与测量", "图形的运动与位置", "统计与概率", "探索与发现", "测试（前6讲）", "正负数和有理数",
						"有理数的加减法", "有理数的乘除法"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["复习——七下文言文（一）", "复习——七下文言文（二）", "复习——七下名著阅读", "预习——《三峡》", "预习——《<孟子>两章》", "预习——《红星照耀中国》",
						"现代文阅读——修辞手法的作用", "现代文阅读——人称的作用", "现代文阅读——记叙顺序及作用", "现代文阅读——人物描写"
					]
				}, {
					"subject": "数学",
					"detail": ["与三角形有关的线段", "与三角形有关的角", "多边形及其内角和", "全等三角形性质与判定（一）", "全等三角形判断（二）", "角的平分线的性质", "测试（前6讲）",
						"轴对称", "等腰三角形", "整式的乘法"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["一元二次方程的定义和解法", "实际问题与一元二次方程", "二次函数的定义及平移问题", "二次函数的图象及性质", "二次函数与一元二次方程", "实际问题与二次函数",
						"测试（前6讲）", "旋转", "圆的有关性质", "点和圆、直线和圆的位置关系"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["代数式変形", "一元二次方程与二次函数", "不等式", "集合概念及其表示", "集合之间的关系与运算", "函数的概念及表示", "测试（前6讲）", "函数的单调性",
						"函数的奇偶性", "指数函数"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["空间几何体", "空间几何体的表面积和体积", "平面", "点线面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质", "测试（前6讲）", "直线、平面垂直的判定",
						"直线、平面垂直的性质", "空间向量及其运算"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8复习", "升高二Unit9复习", "升高二Unit10复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						" unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合", "命题和充要条件", "函数的概念及其表示", "函数的性质", "指数函数", "对数函数与幂函数", "函数与方程", "导数的计算及几何意义",
						"导数在函数研究中的应用", "导数与函数的综合问题"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "ks",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					]
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A ",
						"五年级上册Unit1-Part B ", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					]
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", " 阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					]
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					]
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A ", "六年级上册Unit1-Part B "
					]
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["字词复习", "句型转换", "课内现代文预习——《春》", "课内现代文预习——《秋天的怀念》", "课内文言文预习——《世说新语》两则", "课内文言文预习——《论语十二章》",
						"课内名著预习——《朝花夕拾》", "现代文阅读——修辞手法区分及作用", "现代文阅读——概括文章主要内容", "古诗词鉴赏——情感分析"
					]
				}, {
					"subject": "数学",
					"detail": ["数的认识和运算", "式与方程、比和比例", "图形的认识与测量", "图形的运动与位置", "统计与概率", "探索与发现", "测试（前6讲）", "正负数和有理数",
						"有理数的加减法", "有理数的乘除法"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["复习——七下文言文（一）", "复习——七下文言文（二）", "复习——七下名著阅读", "预习——《三峡》", "预习——《<孟子>两章》", "预习——《红星照耀中国》",
						"现代文阅读——修辞手法的作用", "现代文阅读——人称的作用", "现代文阅读——记叙顺序及作用", "现代文阅读——人物描写"
					]
				}, {
					"subject": "数学",
					"detail": ["与三角形有关的线段", "与三角形有关的角", "多边形及其内角和", "全等三角形性质与判定（一）", "全等三角形判断（二）", "角的平分线的性质", "测试（前6讲）",
						"轴对称", "等腰三角形", "整式的乘法"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["一元二次方程的定义和解法", "实际问题与一元二次方程", "二次函数的定义及平移问题", "二次函数的图象及性质", "二次函数与一元二次方程", "实际问题与二次函数",
						"测试（前6讲）", "旋转", "圆的有关性质", "点和圆、直线和圆的位置关系"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["代数式変形", "一元二次方程与二次函数", "不等式", "集合概念及其表示", "集合之间的关系与运算", "函数的概念及表示", "测试（前6讲）", "函数的单调性",
						"函数的奇偶性", "指数函数"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["空间几何体", "空间几何体的表面积和体积", "平面", "点线面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质", "测试（前6讲）", "直线、平面垂直的判定",
						"直线、平面垂直的性质", "空间向量及其运算"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8复习", "升高二Unit9复习", "升高二Unit10复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						" unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合", "命题和充要条件", "函数的概念及其表示", "函数的性质", "指数函数", "对数函数与幂函数", "函数与方程", "导数的计算及几何意义",
						"导数在函数研究中的应用", "导数与函数的综合问题"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "zjg",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年晓教育某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年晓教育某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					]
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年晓教育某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A ",
						"五年级上册Unit1-Part B ", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					]
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年晓教育某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", " 阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					]
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					]
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A ", "六年级上册Unit1-Part B "
					]
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年晓教育某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["字词复习", "句型转换", "课内现代文预习——《春》", "课内现代文预习——《秋天的怀念》", "课内文言文预习——《世说新语》两则", "课内文言文预习——《论语十二章》",
						"课内名著预习——《朝花夕拾》", "现代文阅读——修辞手法区分及作用", "现代文阅读——概括文章主要内容", "古诗词鉴赏——情感分析"
					]
				}, {
					"subject": "数学",
					"detail": ["数的认识和运算", "式与方程、比和比例", "图形的认识与测量", "图形的运动与位置", "统计与概率", "探索与发现", "测试（前6讲）", "正负数和有理数",
						"有理数的加减法", "有理数的乘除法"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年晓教育某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["复习——七下文言文（一）", "复习——七下文言文（二）", "复习——七下名著阅读", "预习——《三峡》", "预习——《<孟子>两章》", "预习——《红星照耀中国》",
						"现代文阅读——修辞手法的作用", "现代文阅读——人称的作用", "现代文阅读——记叙顺序及作用", "现代文阅读——人物描写"
					]
				}, {
					"subject": "数学",
					"detail": ["与三角形有关的线段", "与三角形有关的角", "多边形及其内角和", "全等三角形性质与判定（一）", "全等三角形判断（二）", "角的平分线的性质", "测试（前6讲）",
						"轴对称", "等腰三角形", "整式的乘法"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年晓教育某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["一元二次方程的定义和解法", "实际问题与一元二次方程", "二次函数的定义及平移问题", "二次函数的图象及性质", "二次函数与一元二次方程", "实际问题与二次函数",
						"测试（前6讲）", "旋转", "圆的有关性质", "点和圆、直线和圆的位置关系"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年晓教育某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["代数式変形", "一元二次方程与二次函数", "不等式", "集合概念及其表示", "集合之间的关系与运算", "函数的概念及表示", "测试（前6讲）", "函数的单调性",
						"函数的奇偶性", "指数函数"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年晓教育某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["空间几何体", "空间几何体的表面积和体积", "平面", "点线面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质", "测试（前6讲）", "直线、平面垂直的判定",
						"直线、平面垂直的性质", "空间向量及其运算"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8复习", "升高二Unit9复习", "升高二Unit10复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						" unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年晓教育某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合", "命题和充要条件", "函数的概念及其表示", "函数的性质", "指数函数", "对数函数与幂函数", "函数与方程", "导数的计算及几何意义",
						"导数在函数研究中的应用", "导数与函数的综合问题"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "hangzhou",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					]
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A ",
						"五年级上册Unit1-Part B ", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					]
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", " 阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					]
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					]
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A ", "六年级上册Unit1-Part B "
					]
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["字词复习", "句型转换", "课内现代文预习——《春》", "课内现代文预习——《秋天的怀念》", "课内文言文预习——《世说新语》两则", "课内文言文预习——《论语十二章》",
						"课内名著预习——《朝花夕拾》", "现代文阅读——修辞手法区分及作用", "现代文阅读——概括文章主要内容", "古诗词鉴赏——情感分析"
					]
				}, {
					"subject": "数学",
					"detail": ["数的认识和运算", "式与方程、比和比例", "图形的认识与测量", "图形的运动与位置", "统计与概率", "探索与发现", "测试（前6讲）", "正负数和有理数",
						"有理数的加减法", "有理数的乘除法"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}, {
					"subject": "科学",
					"detail": ["科学并不神秘与走进科学实验室", "科学观察与科学观测", "科学探究", "生物与非生物、细胞", "生物体的结构层次", "常见的动物", "常见的植物、物种多样性",
						"物质的构成、质量的测量", "物质的密度、比热", "物质的三态变化"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["复习——七下文言文（一）", "复习——七下文言文（二）", "复习——七下名著阅读", "预习——《三峡》", "预习——《<孟子>两章》", "预习——《红星照耀中国》",
						"现代文阅读——修辞手法的作用", "现代文阅读——人称的作用", "现代文阅读——记叙顺序及作用", "现代文阅读——人物描写"
					]
				}, {
					"subject": "数学",
					"detail": ["与三角形有关的线段", "与三角形有关的角", "多边形及其内角和", "全等三角形性质与判定（一）", "全等三角形判断（二）", "角的平分线的性质", "测试（前6讲）",
						"轴对称", "等腰三角形", "整式的乘法"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "科学",
					"detail": ["地球上的水和水的组成", "水的浮力（一）", "水的浮力（二）", "物质在水中的分散状况", "物质的溶解", "物质的分离", "大气压强", "电路与电流", "电阻与变阻器",
						"电压与欧姆定律"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["一元二次方程的定义和解法", "实际问题与一元二次方程", "二次函数的定义及平移问题", "二次函数的图象及性质", "二次函数与一元二次方程", "实际问题与二次函数",
						"测试（前6讲）", "旋转", "圆的有关性质", "点和圆、直线和圆的位置关系"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "科学",
					"detail": ["物质的变化  酸碱性", "常见的酸", "常见的碱", "重要的盐", "金属", "有机物、物质的分类", "物质的转化", "机械能", "功和功率", "简单机械"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["代数式変形", "一元二次方程与二次函数", "不等式", "集合概念及其表示", "集合之间的关系与运算", "函数的概念及表示", "测试（前6讲）", "函数的单调性",
						"函数的奇偶性", "指数函数"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["空间几何体", "空间几何体的表面积和体积", "平面", "点线面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质", "测试（前6讲）", "直线、平面垂直的判定",
						"直线、平面垂直的性质", "空间向量及其运算"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8复习", "升高二Unit9复习", "升高二Unit10复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						" unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合", "命题和充要条件", "函数的概念及其表示", "函数的性质", "指数函数", "对数函数与幂函数", "函数与方程", "导数的计算及几何意义",
						"导数在函数研究中的应用", "导数与函数的综合问题"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}]
			}]
		}]
	}, {
		"city": "jh",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					]
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A ",
						"五年级上册Unit1-Part B ", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					]
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", " 阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					]
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					]
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A ", "六年级上册Unit1-Part B "
					]
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["字词复习", "句型转换", "课内现代文预习——《春》", "课内现代文预习——《秋天的怀念》", "课内文言文预习——《世说新语》两则", "课内文言文预习——《论语十二章》",
						"课内名著预习——《朝花夕拾》", "现代文阅读——修辞手法区分及作用", "现代文阅读——概括文章主要内容", "古诗词鉴赏——情感分析"
					]
				}, {
					"subject": "数学",
					"detail": ["数的认识和运算", "式与方程、比和比例", "图形的认识与测量", "图形的运动与位置", "统计与概率", "探索与发现", "测试（前6讲）", "正负数和有理数",
						"有理数的加减法", "有理数的乘除法"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}, {
					"subject": "科学",
					"detail": ["科学并不神秘与走进科学实验室", "科学观察与科学观测", "科学探究", "生物与非生物、细胞", "生物体的结构层次", "常见的动物", "常见的植物、物种多样性",
						"物质的构成、质量的测量", "物质的密度、比热", "物质的三态变化"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["复习——七下文言文（一）", "复习——七下文言文（二）", "复习——七下名著阅读", "预习——《三峡》", "预习——《<孟子>两章》", "预习——《红星照耀中国》",
						"现代文阅读——修辞手法的作用", "现代文阅读——人称的作用", "现代文阅读——记叙顺序及作用", "现代文阅读——人物描写"
					]
				}, {
					"subject": "数学",
					"detail": ["与三角形有关的线段", "与三角形有关的角", "多边形及其内角和", "全等三角形性质与判定（一）", "全等三角形判断（二）", "角的平分线的性质", "测试（前6讲）",
						"轴对称", "等腰三角形", "整式的乘法"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "科学",
					"detail": ["地球上的水和水的组成", "水的浮力（一）", "水的浮力（二）", "物质在水中的分散状况", "物质的溶解", "物质的分离", "大气压强", "电路与电流", "电阻与变阻器",
						"电压与欧姆定律"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["一元二次方程的定义和解法", "实际问题与一元二次方程", "二次函数的定义及平移问题", "二次函数的图象及性质", "二次函数与一元二次方程", "实际问题与二次函数",
						"测试（前6讲）", "旋转", "圆的有关性质", "点和圆、直线和圆的位置关系"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "科学",
					"detail": ["物质的变化  酸碱性", "常见的酸", "常见的碱", "重要的盐", "金属", "有机物、物质的分类", "物质的转化", "机械能", "功和功率", "简单机械"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["代数式変形", "一元二次方程与二次函数", "不等式", "集合概念及其表示", "集合之间的关系与运算", "函数的概念及表示", "测试（前6讲）", "函数的单调性",
						"函数的奇偶性", "指数函数"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["空间几何体", "空间几何体的表面积和体积", "平面", "点线面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质", "测试（前6讲）", "直线、平面垂直的判定",
						"直线、平面垂直的性质", "空间向量及其运算"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8复习", "升高二Unit9复习", "升高二Unit10复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						" unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合", "命题和充要条件", "函数的概念及其表示", "函数的性质", "指数函数", "对数函数与幂函数", "函数与方程", "导数的计算及几何意义",
						"导数在函数研究中的应用", "导数与函数的综合问题"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}]
			}]
		}]
	}, {
		"city": "tz",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					]
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A ",
						"五年级上册Unit1-Part B ", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					]
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", " 阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					]
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					]
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A ", "六年级上册Unit1-Part B "
					]
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["字词复习", "句型转换", "课内现代文预习——《春》", "课内现代文预习——《秋天的怀念》", "课内文言文预习——《世说新语》两则", "课内文言文预习——《论语十二章》",
						"课内名著预习——《朝花夕拾》", "现代文阅读——修辞手法区分及作用", "现代文阅读——概括文章主要内容", "古诗词鉴赏——情感分析"
					]
				}, {
					"subject": "数学",
					"detail": ["数的认识和运算", "式与方程、比和比例", "图形的认识与测量", "图形的运动与位置", "统计与概率", "探索与发现", "测试（前6讲）", "正负数和有理数",
						"有理数的加减法", "有理数的乘除法"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}, {
					"subject": "科学",
					"detail": ["科学并不神秘与走进科学实验室", "科学观察与科学观测", "科学探究", "生物与非生物、细胞", "生物体的结构层次", "常见的动物", "常见的植物、物种多样性",
						"物质的构成、质量的测量", "物质的密度、比热", "物质的三态变化"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["复习——七下文言文（一）", "复习——七下文言文（二）", "复习——七下名著阅读", "预习——《三峡》", "预习——《<孟子>两章》", "预习——《红星照耀中国》",
						"现代文阅读——修辞手法的作用", "现代文阅读——人称的作用", "现代文阅读——记叙顺序及作用", "现代文阅读——人物描写"
					]
				}, {
					"subject": "数学",
					"detail": ["与三角形有关的线段", "与三角形有关的角", "多边形及其内角和", "全等三角形性质与判定（一）", "全等三角形判断（二）", "角的平分线的性质", "测试（前6讲）",
						"轴对称", "等腰三角形", "整式的乘法"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "科学",
					"detail": ["地球上的水和水的组成", "水的浮力（一）", "水的浮力（二）", "物质在水中的分散状况", "物质的溶解", "物质的分离", "大气压强", "电路与电流", "电阻与变阻器",
						"电压与欧姆定律"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["一元二次方程的定义和解法", "实际问题与一元二次方程", "二次函数的定义及平移问题", "二次函数的图象及性质", "二次函数与一元二次方程", "实际问题与二次函数",
						"测试（前6讲）", "旋转", "圆的有关性质", "点和圆、直线和圆的位置关系"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "科学",
					"detail": ["物质的变化  酸碱性", "常见的酸", "常见的碱", "重要的盐", "金属", "有机物、物质的分类", "物质的转化", "机械能", "功和功率", "简单机械"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["代数式変形", "一元二次方程与二次函数", "不等式", "集合概念及其表示", "集合之间的关系与运算", "函数的概念及表示", "测试（前6讲）", "函数的单调性",
						"函数的奇偶性", "指数函数"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["空间几何体", "空间几何体的表面积和体积", "平面", "点线面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质", "测试（前6讲）", "直线、平面垂直的判定",
						"直线、平面垂直的性质", "空间向量及其运算"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8复习", "升高二Unit9复习", "升高二Unit10复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						" unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合", "命题和充要条件", "函数的概念及其表示", "函数的性质", "指数函数", "对数函数与幂函数", "函数与方程", "导数的计算及几何意义",
						"导数在函数研究中的应用", "导数与函数的综合问题"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}]
			}]
		}]
	}, {
		"city": "wz",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					]
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A ",
						"五年级上册Unit1-Part B ", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					]
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", " 阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					]
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					]
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A ", "六年级上册Unit1-Part B "
					]
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["字词复习", "句型转换", "课内现代文预习——《春》", "课内现代文预习——《秋天的怀念》", "课内文言文预习——《世说新语》两则", "课内文言文预习——《论语十二章》",
						"课内名著预习——《朝花夕拾》", "现代文阅读——修辞手法区分及作用", "现代文阅读——概括文章主要内容", "古诗词鉴赏——情感分析"
					]
				}, {
					"subject": "数学",
					"detail": ["数的认识和运算", "式与方程、比和比例", "图形的认识与测量", "图形的运动与位置", "统计与概率", "探索与发现", "测试（前6讲）", "正负数和有理数",
						"有理数的加减法", "有理数的乘除法"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}, {
					"subject": "科学",
					"detail": ["科学并不神秘与走进科学实验室", "科学观察与科学观测", "科学探究", "生物与非生物、细胞", "生物体的结构层次", "常见的动物", "常见的植物、物种多样性",
						"物质的构成、质量的测量", "物质的密度、比热", "物质的三态变化"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["复习——七下文言文（一）", "复习——七下文言文（二）", "复习——七下名著阅读", "预习——《三峡》", "预习——《<孟子>两章》", "预习——《红星照耀中国》",
						"现代文阅读——修辞手法的作用", "现代文阅读——人称的作用", "现代文阅读——记叙顺序及作用", "现代文阅读——人物描写"
					]
				}, {
					"subject": "数学",
					"detail": ["与三角形有关的线段", "与三角形有关的角", "多边形及其内角和", "全等三角形性质与判定（一）", "全等三角形判断（二）", "角的平分线的性质", "测试（前6讲）",
						"轴对称", "等腰三角形", "整式的乘法"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "科学",
					"detail": ["地球上的水和水的组成", "水的浮力（一）", "水的浮力（二）", "物质在水中的分散状况", "物质的溶解", "物质的分离", "大气压强", "电路与电流", "电阻与变阻器",
						"电压与欧姆定律"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["一元二次方程的定义和解法", "实际问题与一元二次方程", "二次函数的定义及平移问题", "二次函数的图象及性质", "二次函数与一元二次方程", "实际问题与二次函数",
						"测试（前6讲）", "旋转", "圆的有关性质", "点和圆、直线和圆的位置关系"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "科学",
					"detail": ["物质的变化  酸碱性", "常见的酸", "常见的碱", "重要的盐", "金属", "有机物、物质的分类", "物质的转化", "机械能", "功和功率", "简单机械"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["代数式変形", "一元二次方程与二次函数", "不等式", "集合概念及其表示", "集合之间的关系与运算", "函数的概念及表示", "测试（前6讲）", "函数的单调性",
						"函数的奇偶性", "指数函数"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["空间几何体", "空间几何体的表面积和体积", "平面", "点线面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质", "测试（前6讲）", "直线、平面垂直的判定",
						"直线、平面垂直的性质", "空间向量及其运算"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8复习", "升高二Unit9复习", "升高二Unit10复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						" unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合", "命题和充要条件", "函数的概念及其表示", "函数的性质", "指数函数", "对数函数与幂函数", "函数与方程", "导数的计算及几何意义",
						"导数在函数研究中的应用", "导数与函数的综合问题"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}]
			}]
		}]
	}, {
		"city": "sx",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					]
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A ",
						"五年级上册Unit1-Part B ", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					]
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", " 阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					]
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					]
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A ", "六年级上册Unit1-Part B "
					]
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["字词复习", "句型转换", "课内现代文预习——《春》", "课内现代文预习——《秋天的怀念》", "课内文言文预习——《世说新语》两则", "课内文言文预习——《论语十二章》",
						"课内名著预习——《朝花夕拾》", "现代文阅读——修辞手法区分及作用", "现代文阅读——概括文章主要内容", "古诗词鉴赏——情感分析"
					]
				}, {
					"subject": "数学",
					"detail": ["数的认识和运算", "式与方程、比和比例", "图形的认识与测量", "图形的运动与位置", "统计与概率", "探索与发现", "测试（前6讲）", "正负数和有理数",
						"有理数的加减法", "有理数的乘除法"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}, {
					"subject": "科学",
					"detail": ["科学并不神秘与走进科学实验室", "科学观察与科学观测", "科学探究", "生物与非生物、细胞", "生物体的结构层次", "常见的动物", "常见的植物、物种多样性",
						"物质的构成、质量的测量", "物质的密度、比热", "物质的三态变化"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["复习——七下文言文（一）", "复习——七下文言文（二）", "复习——七下名著阅读", "预习——《三峡》", "预习——《<孟子>两章》", "预习——《红星照耀中国》",
						"现代文阅读——修辞手法的作用", "现代文阅读——人称的作用", "现代文阅读——记叙顺序及作用", "现代文阅读——人物描写"
					]
				}, {
					"subject": "数学",
					"detail": ["与三角形有关的线段", "与三角形有关的角", "多边形及其内角和", "全等三角形性质与判定（一）", "全等三角形判断（二）", "角的平分线的性质", "测试（前6讲）",
						"轴对称", "等腰三角形", "整式的乘法"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "科学",
					"detail": ["地球上的水和水的组成", "水的浮力（一）", "水的浮力（二）", "物质在水中的分散状况", "物质的溶解", "物质的分离", "大气压强", "电路与电流", "电阻与变阻器",
						"电压与欧姆定律"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["一元二次方程的定义和解法", "实际问题与一元二次方程", "二次函数的定义及平移问题", "二次函数的图象及性质", "二次函数与一元二次方程", "实际问题与二次函数",
						"测试（前6讲）", "旋转", "圆的有关性质", "点和圆、直线和圆的位置关系"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "科学",
					"detail": ["物质的变化  酸碱性", "常见的酸", "常见的碱", "重要的盐", "金属", "有机物、物质的分类", "物质的转化", "机械能", "功和功率", "简单机械"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["代数式変形", "一元二次方程与二次函数", "不等式", "集合概念及其表示", "集合之间的关系与运算", "函数的概念及表示", "测试（前6讲）", "函数的单调性",
						"函数的奇偶性", "指数函数"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["空间几何体", "空间几何体的表面积和体积", "平面", "点线面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质", "测试（前6讲）", "直线、平面垂直的判定",
						"直线、平面垂直的性质", "空间向量及其运算"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8复习", "升高二Unit9复习", "升高二Unit10复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						" unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合", "命题和充要条件", "函数的概念及其表示", "函数的性质", "指数函数", "对数函数与幂函数", "函数与方程", "导数的计算及几何意义",
						"导数在函数研究中的应用", "导数与函数的综合问题"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}]
			}]
		}]
	}, {
		"city": "jx",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					]
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A ",
						"五年级上册Unit1-Part B ", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					]
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", " 阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					]
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					]
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A ", "六年级上册Unit1-Part B "
					]
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["字词复习", "句型转换", "课内现代文预习——《春》", "课内现代文预习——《秋天的怀念》", "课内文言文预习——《世说新语》两则", "课内文言文预习——《论语十二章》",
						"课内名著预习——《朝花夕拾》", "现代文阅读——修辞手法区分及作用", "现代文阅读——概括文章主要内容", "古诗词鉴赏——情感分析"
					]
				}, {
					"subject": "数学",
					"detail": ["数的认识和运算", "式与方程、比和比例", "图形的认识与测量", "图形的运动与位置", "统计与概率", "探索与发现", "测试（前6讲）", "正负数和有理数",
						"有理数的加减法", "有理数的乘除法"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}, {
					"subject": "科学",
					"detail": ["科学并不神秘与走进科学实验室", "科学观察与科学观测", "科学探究", "生物与非生物、细胞", "生物体的结构层次", "常见的动物", "常见的植物、物种多样性",
						"物质的构成、质量的测量", "物质的密度、比热", "物质的三态变化"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["复习——七下文言文（一）", "复习——七下文言文（二）", "复习——七下名著阅读", "预习——《三峡》", "预习——《<孟子>两章》", "预习——《红星照耀中国》",
						"现代文阅读——修辞手法的作用", "现代文阅读——人称的作用", "现代文阅读——记叙顺序及作用", "现代文阅读——人物描写"
					]
				}, {
					"subject": "数学",
					"detail": ["与三角形有关的线段", "与三角形有关的角", "多边形及其内角和", "全等三角形性质与判定（一）", "全等三角形判断（二）", "角的平分线的性质", "测试（前6讲）",
						"轴对称", "等腰三角形", "整式的乘法"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "科学",
					"detail": ["地球上的水和水的组成", "水的浮力（一）", "水的浮力（二）", "物质在水中的分散状况", "物质的溶解", "物质的分离", "大气压强", "电路与电流", "电阻与变阻器",
						"电压与欧姆定律"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["一元二次方程的定义和解法", "实际问题与一元二次方程", "二次函数的定义及平移问题", "二次函数的图象及性质", "二次函数与一元二次方程", "实际问题与二次函数",
						"测试（前6讲）", "旋转", "圆的有关性质", "点和圆、直线和圆的位置关系"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "科学",
					"detail": ["物质的变化  酸碱性", "常见的酸", "常见的碱", "重要的盐", "金属", "有机物、物质的分类", "物质的转化", "机械能", "功和功率", "简单机械"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["代数式変形", "一元二次方程与二次函数", "不等式", "集合概念及其表示", "集合之间的关系与运算", "函数的概念及表示", "测试（前6讲）", "函数的单调性",
						"函数的奇偶性", "指数函数"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["空间几何体", "空间几何体的表面积和体积", "平面", "点线面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质", "测试（前6讲）", "直线、平面垂直的判定",
						"直线、平面垂直的性质", "空间向量及其运算"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8复习", "升高二Unit9复习", "升高二Unit10复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						" unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合", "命题和充要条件", "函数的概念及其表示", "函数的性质", "指数函数", "对数函数与幂函数", "函数与方程", "导数的计算及几何意义",
						"导数在函数研究中的应用", "导数与函数的综合问题"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}]
			}]
		}]
	}, {
		"city": "huzhou",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					]
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					]
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					]
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A ",
						"五年级上册Unit1-Part B ", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					]
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", " 阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					]
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					]
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A ", "六年级上册Unit1-Part B "
					]
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["字词复习", "句型转换", "课内现代文预习——《春》", "课内现代文预习——《秋天的怀念》", "课内文言文预习——《世说新语》两则", "课内文言文预习——《论语十二章》",
						"课内名著预习——《朝花夕拾》", "现代文阅读——修辞手法区分及作用", "现代文阅读——概括文章主要内容", "古诗词鉴赏——情感分析"
					]
				}, {
					"subject": "数学",
					"detail": ["数的认识和运算", "式与方程、比和比例", "图形的认识与测量", "图形的运动与位置", "统计与概率", "探索与发现", "测试（前6讲）", "正负数和有理数",
						"有理数的加减法", "有理数的乘除法"
					]
				}, {
					"subject": "英语",
					"detail": ["Starter Unit 1-2", "Starter Unit 3", "Unit 1", "Unit 2", "Unit 3", "Unit 4", "Unit 5",
						"人称代词—主格宾格", "人称代词—形容词性物主代词", "人称代词—名词性物主代词"
					]
				}, {
					"subject": "科学",
					"detail": ["科学并不神秘与走进科学实验室", "科学观察与科学观测", "科学探究", "生物与非生物、细胞", "生物体的结构层次", "常见的动物", "常见的植物、物种多样性",
						"物质的构成、质量的测量", "物质的密度、比热", "物质的三态变化"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["复习——七下文言文（一）", "复习——七下文言文（二）", "复习——七下名著阅读", "预习——《三峡》", "预习——《<孟子>两章》", "预习——《红星照耀中国》",
						"现代文阅读——修辞手法的作用", "现代文阅读——人称的作用", "现代文阅读——记叙顺序及作用", "现代文阅读——人物描写"
					]
				}, {
					"subject": "数学",
					"detail": ["与三角形有关的线段", "与三角形有关的角", "多边形及其内角和", "全等三角形性质与判定（一）", "全等三角形判断（二）", "角的平分线的性质", "测试（前6讲）",
						"轴对称", "等腰三角形", "整式的乘法"
					]
				}, {
					"subject": "英语",
					"detail": ["八上unit1 Section A预习", "八上unit1 Section B预习", "八上unit2 Section A预习", "八上unit2 Section B预习",
						"八上unit3 Section A预习", "八上unit3 Section B预习", "三大时态专题", "句型专题", "七上unit 1-9复习", "七下unit 1-4复习"
					]
				}, {
					"subject": "科学",
					"detail": ["地球上的水和水的组成", "水的浮力（一）", "水的浮力（二）", "物质在水中的分散状况", "物质的溶解", "物质的分离", "大气压强", "电路与电流", "电阻与变阻器",
						"电压与欧姆定律"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["一元二次方程的定义和解法", "实际问题与一元二次方程", "二次函数的定义及平移问题", "二次函数的图象及性质", "二次函数与一元二次方程", "实际问题与二次函数",
						"测试（前6讲）", "旋转", "圆的有关性质", "点和圆、直线和圆的位置关系"
					]
				}, {
					"subject": "英语",
					"detail": ["九年级unit1 Section A预习", "九年级unit1 Section B预习", "九年级unit2 Section A预习", "九年级unit2 Section B预习",
						"九年级unit3 Section A预习", "九年级unit3 Section B预习", "九年级unit 1-3 复习", "八下units1-4", "八下units5-7",
						"八下units8-10"
					]
				}, {
					"subject": "科学",
					"detail": ["物质的变化  酸碱性", "常见的酸", "常见的碱", "重要的盐", "金属", "有机物、物质的分类", "物质的转化", "机械能", "功和功率", "简单机械"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["代数式変形", "一元二次方程与二次函数", "不等式", "集合概念及其表示", "集合之间的关系与运算", "函数的概念及表示", "测试（前6讲）", "函数的单调性",
						"函数的奇偶性", "指数函数"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第二课重点词汇句型精讲", "第二单元第三课重点词汇句型精讲", "第二单元第四课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["空间几何体", "空间几何体的表面积和体积", "平面", "点线面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质", "测试（前6讲）", "直线、平面垂直的判定",
						"直线、平面垂直的性质", "空间向量及其运算"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8复习", "升高二Unit9复习", "升高二Unit10复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						" unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合", "命题和充要条件", "函数的概念及其表示", "函数的性质", "指数函数", "对数函数与幂函数", "函数与方程", "导数的计算及几何意义",
						"导数在函数研究中的应用", "导数与函数的综合问题"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}]
			}]
		}]
	}, {
		"city": "dg",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["升初一时态综合", "升初一形容词副词比较级", "升初一音标", "升初一冠词数词", "升初一名词", "升初一代词", "升初一完形填空", "升初一阅读理解",
						"升初一短文填空", "升初一写作"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["七下M1-2复习", "七下M3-4复习", "七下M5-6复习", "七下M7-8复习", "七下M9-10复习", "七下M11-12复习", "八上M1预习",
						"初二上册预习Module 2", "初二上册预习Module 3", "初二上册预习Module 4"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["升初三M1-2复习", "升初三M3-4复习", "升初三M5-6复习", "升初三M7-8复习", "升初三M9-10复习", "初三上M1part1", "初三上M1part2",
						"初三上M2part1", "初三上M2part2", "初三上M3part1"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "fs",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["升初一时态综合", "升初一形容词副词比较级", "升初一音标", "升初一冠词数词", "升初一名词", "升初一代词", "升初一完形填空", "升初一阅读理解",
						"升初一短文填空", "升初一写作"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["七下M1-2复习", "七下M3-4复习", "七下M5-6复习", "七下M7-8复习", "七下M9-10复习", "七下M11-12复习", "八上M1预习",
						"初二上册预习Module 2", "初二上册预习Module 3", "初二上册预习Module 4"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["升初三M1-2复习", "升初三M3-4复习", "升初三M5-6复习", "升初三M7-8复习", "升初三M9-10复习", "初三上M1part1", "初三上M1part2",
						"初三上M2part1", "初三上M2part2", "初三上M3part1"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "hz",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["升初一时态综合", "升初一形容词副词比较级", "升初一音标", "升初一冠词数词", "升初一名词", "升初一代词", "升初一完形填空", "升初一阅读理解",
						"升初一短文填空", "升初一写作"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["七下M1-2复习", "七下M3-4复习", "七下M5-6复习", "七下M7-8复习", "七下M9-10复习", "七下M11-12复习", "八上M1预习",
						"初二上册预习Module 2", "初二上册预习Module 3", "初二上册预习Module 4"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["升初三M1-2复习", "升初三M3-4复习", "升初三M5-6复习", "升初三M7-8复习", "升初三M9-10复习", "初三上M1part1", "初三上M1part2",
						"初三上M2part1", "初三上M2part2", "初三上M3part1"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "zs",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["升初一时态综合", "升初一形容词副词比较级", "升初一音标", "升初一冠词数词", "升初一名词", "升初一代词", "升初一完形填空", "升初一阅读理解",
						"升初一短文填空", "升初一写作"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["七下M1-2复习", "七下M3-4复习", "七下M5-6复习", "七下M7-8复习", "七下M9-10复习", "七下M11-12复习", "八上M1预习",
						"初二上册预习Module 2", "初二上册预习Module 3", "初二上册预习Module 4"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["升初三M1-2复习", "升初三M3-4复习", "升初三M5-6复习", "升初三M7-8复习", "升初三M9-10复习", "初三上M1part1", "初三上M1part2",
						"初三上M2part1", "初三上M2part2", "初三上M3part1"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "sd",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["升初一时态综合", "升初一形容词副词比较级", "升初一音标", "升初一冠词数词", "升初一名词", "升初一代词", "升初一完形填空", "升初一阅读理解",
						"升初一短文填空", "升初一写作"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["七下M1-2复习", "七下M3-4复习", "七下M5-6复习", "七下M7-8复习", "七下M9-10复习", "七下M11-12复习", "八上M1预习",
						"初二上册预习Module 2", "初二上册预习Module 3", "初二上册预习Module 4"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["升初三M1-2复习", "升初三M3-4复习", "升初三M5-6复习", "升初三M7-8复习", "升初三M9-10复习", "初三上M1part1", "初三上M1part2",
						"初三上M2part1", "初三上M2part2", "初三上M3part1"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "jm",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["升初一时态综合", "升初一形容词副词比较级", "升初一音标", "升初一冠词数词", "升初一名词", "升初一代词", "升初一完形填空", "升初一阅读理解",
						"升初一短文填空", "升初一写作"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["七下M1-2复习", "七下M3-4复习", "七下M5-6复习", "七下M7-8复习", "七下M9-10复习", "七下M11-12复习", "八上M1预习",
						"初二上册预习Module 2", "初二上册预习Module 3", "初二上册预习Module 4"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["升初三M1-2复习", "升初三M3-4复习", "升初三M5-6复习", "升初三M7-8复习", "升初三M9-10复习", "初三上M1part1", "初三上M1part2",
						"初三上M2part1", "初三上M2part2", "初三上M3part1"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "zh",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["升初一时态综合", "升初一形容词副词比较级", "升初一音标", "升初一冠词数词", "升初一名词", "升初一代词", "升初一完形填空", "升初一阅读理解",
						"升初一短文填空", "升初一写作"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["七下M1-2复习", "七下M3-4复习", "七下M5-6复习", "七下M7-8复习", "七下M9-10复习", "七下M11-12复习", "八上M1预习",
						"初二上册预习Module 2", "初二上册预习Module 3", "初二上册预习Module 4"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["升初三M1-2复习", "升初三M3-4复习", "升初三M5-6复习", "升初三M7-8复习", "升初三M9-10复习", "初三上M1part1", "初三上M1part2",
						"初三上M2part1", "初三上M2part2", "初三上M3part1"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "sz",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["升初一时态综合", "升初一形容词副词比较级", "升初一音标", "升初一冠词数词", "升初一名词", "升初一代词", "升初一完形填空", "升初一阅读理解",
						"升初一短文填空", "升初一写作"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["七下M1-2复习", "七下M3-4复习", "七下M5-6复习", "七下M7-8复习", "七下M9-10复习", "七下M11-12复习", "八上M1预习",
						"初二上册预习Module 2", "初二上册预习Module 3", "初二上册预习Module 4"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["升初三M1-2复习", "升初三M3-4复习", "升初三M5-6复习", "升初三M7-8复习", "升初三M9-10复习", "初三上M1part1", "初三上M1part2",
						"初三上M2part1", "初三上M2part2", "初三上M3part1"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "zj",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["升初一时态综合", "升初一形容词副词比较级", "升初一音标", "升初一冠词数词", "升初一名词", "升初一代词", "升初一完形填空", "升初一阅读理解",
						"升初一短文填空", "升初一写作"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["七下M1-2复习", "七下M3-4复习", "七下M5-6复习", "七下M7-8复习", "七下M9-10复习", "七下M11-12复习", "八上M1预习",
						"初二上册预习Module 2", "初二上册预习Module 3", "初二上册预习Module 4"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["升初三M1-2复习", "升初三M3-4复习", "升初三M5-6复习", "升初三M7-8复习", "升初三M9-10复习", "初三上M1part1", "初三上M1part2",
						"初三上M2part1", "初三上M2part2", "初三上M3part1"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "gz",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["升初一时态综合", "升初一形容词副词比较级", "升初一音标", "升初一冠词数词", "升初一名词", "升初一代词", "升初一完形填空", "升初一阅读理解",
						"升初一短文填空", "升初一写作"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["七下M1-2复习", "七下M3-4复习", "七下M5-6复习", "七下M7-8复习", "七下M9-10复习", "七下M11-12复习", "八上M1预习",
						"初二上册预习Module 2", "初二上册预习Module 3", "初二上册预习Module 4"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["升初三M1-2复习", "升初三M3-4复习", "升初三M5-6复习", "升初三M7-8复习", "升初三M9-10复习", "初三上M1part1", "初三上M1part2",
						"初三上M2part1", "初三上M2part2", "初三上M3part1"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}, {
		"city": "nn",
		"grade": [{
			"name": "xx",
			"detail": [{
				"grade": "三年级",
				"tc": "升三年级",
				"title": "2019年星火某学员升三年级暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["数据收集整理+图形的运动", "表内除法（一）", "表内除法（二）", "混合运算", "有余数的除法", "万以内数的认识", "克与千克", "数学广角（推理）",
						"二年级下册总复习", "时、分、秒"
					]
				}, {
					"subject": "英语",
					"detail": ["26个字母的发音和音标认识", "单元音+文具词汇", "单元音+颜色词汇", "单元音+身体部位词汇", "双元音+动物词汇", "双元音+食物词汇", "辅音+数字词汇",
						"总复习", "三年级上册U1PartA", "三年级上册U1PartB"
					]
				}]
			}, {
				"grade": "四年级",
				"tc": "升四年级",
				"title": "2019年星火某学员升四年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "陈述句与反问句转换", "阅读之过渡句", "阅读文章的方法", "字词基础知识巩固", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["位置与方向+复式统计表", "除数是一位数的除法", "两位数乘两位数", "面积", "年月日", "小数的初步认识", "数学广角 搭配（二）", "三年级下册总复习基础",
						"三年级下册总复习提高", "大数的认识（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["三年级下Unit 1", "三年级下Unit 2", "三年级下Unit 3", "三年级下Unit 4", "三年级下Unit 5", "三年级下Unit 6", "总复习",
						"音标", "四年级上U1Part A", "四年级上U1Part B"
					],
				}]
			}, {
				"grade": "五年级",
				"tc": "升五年级",
				"title": "2019年星火某学员升五年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["修改病句", "句型转换", "修辞手法及运用", "关联词", "概括文章主要内容", "文章主旨", "词语、成语理解", "阅读之拟写文章标题", "人物描写",
						"记叙顺序与结构"
					],
				}, {
					"subject": "数学",
					"detail": ["四则运算", "观察物体+图形的运动+统计", "运算定律", "运算定律与简便", "小数的意义和性质", "三角形", "小数的加法和减法", "简便运算总复习", "数学广角",
						"小数乘法（一）"
					],
				}, {
					"subject": "英语",
					"detail": ["四年级下复习U1-U2", "四年级下复习U3-U4", "四年级下复习U5-U6", "小学口语训练和作文专题", "复习阶段测试", "五年级上册Unit1-Part A",
						"五年级上册Unit1-Part B", "五年级上册Unit2-Part A", "五年级上册Unit2-Part B", "阶段测试"
					],
				}]
			}, {
				"grade": "六年级",
				"tc": "升六年级",
				"title": "2019年星火某学员升六年级暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["趣味语文", "句式转换", "修辞手法及其运用", "阅读之理解词句", "作文提升之细节描写", "面试之综合知识", "阅读理解之人物形象", "写作之审题立意",
						"《红楼梦》、《西游记》阅读指导", "《水浒传》、《三国演义》阅读指导"
					],
				}, {
					"subject": "数学",
					"detail": ["因数与倍数", "长方体与正方体", "分数的加减法", "图形的运动与折线统计图", "打电话与找次品", "解决问题", "综合复习", "分数乘法的意义与性质",
						"分数乘整数、分数、小数", "分数乘法中因数与积的大小关系"
					],
				}, {
					"subject": "英语",
					"detail": ["五年级下U1-U2复习", "五年级下U3-U4复习", "五年级下U5-U6复习", "一般现在时", "现在进行时", "一般将来时", "名词专题", "代词专题",
						"六年级上册Unit1-Part A", "六年级上册Unit1-Part B"
					],
				}]
			}]
		}, {
			"name": "cz",
			"detail": [{
				"grade": "初一",
				"tc": "升初一",
				"title": "2019年星火某学员升初一暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["记叙文阅读之内容概括、理清思路", "记叙文阅读之把握人物形象", "写景类文章阅读之赏析修辞手法", "记叙文阅读之赏析人物描写", "文言文阅读之疏通文意",
						"文言文阅读之特殊文言现象（通假字、词类活用等）", "文言文阅读之把握主旨", "病句辨析", "词语的理解与运用", "仿写句子"
					]
				}, {
					"subject": "数学",
					"detail": ["分数、比及百分数的意义及基本运算", "分数、比及百分数的简单运用", "分数、比及百分数的综合运用", "数的运算及方程", "基本平面图形", "基本立体图形",
						"生活中的立体图形", "展开与折叠", "有理数相关概念", "有理数的加减"
					]
				}, {
					"subject": "英语",
					"detail": ["升初一时态综合", "升初一形容词副词比较级", "升初一音标", "升初一冠词数词", "升初一名词", "升初一代词", "升初一完形填空", "升初一阅读理解",
						"升初一短文填空", "升初一写作"
					]
				}]
			}, {
				"grade": "初二",
				"tc": "升初二",
				"title": "2019年星火某学员升初二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["初一  综合复习", "压缩新闻材料（概括提炼）", "《三峡》预习（字词、文意）", "《短文两篇》预习（字词、文意）", "《与朱元思书》预习（字词、文意）",
						"名著阅读《红星照耀中国》（人物、主题）", "散文阅读（形象、情感、手法）", "说明文阅读预习（说明方法）", "《孟子二章》（字词、文意）", "《愚公移山》（字词、文意）"
					]
				}, {
					"subject": "数学",
					"detail": ["整式的运算", "平行的性质与判定", "三角形全等的基础题型", "三角形全等的判定", "三角形边角关系基本模型", "证明三角形全等常见模型", "倍长中线与截长补短",
						"轴对称的性质与运用", "垂直平分线与角平分线", "勾股定理的内容"
					]
				}, {
					"subject": "英语",
					"detail": ["七下M1-2复习", "七下M3-4复习", "七下M5-6复习", "七下M7-8复习", "七下M9-10复习", "七下M11-12复习", "八上M1预习",
						"初二上册预习Module 2", "初二上册预习Module 3", "初二上册预习Module 4"
					]
				}, {
					"subject": "物理",
					"detail": ["科学之旅+时间程度的测量", "运动的描述和快慢", "测量平均速度和速度计算", "第一章复习", "声音的产生和传播", "声音的特性", "声音的利用+噪声", "第二章复习",
						"温度及物态变化", "熔化和凝固"
					]
				}]
			}, {
				"grade": "初三",
				"tc": "升初三",
				"title": "2019年星火某学员升初三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["表现手法", "课外文言文断句及内容分析和把握", "情节概括及作用", "说明文阅读总复习", "小说的主题概括", "议论文复习——论点、论据", "议论文论述方法",
						"水浒传之人物形象", "湖心亭看雪预习", "岳阳楼记预习"
					]
				}, {
					"subject": "数学",
					"detail": ["因式分解", "分式的运算", "分式方程及其应用", "不等式及其应用", "不等式与一次函数", "特殊三角形的证明", "垂直平分线与角平分线", "图形变化", "旋转与全等",
						"平行四边形的证明"
					]
				}, {
					"subject": "英语",
					"detail": ["升初三M1-2复习", "升初三M3-4复习", "升初三M5-6复习", "升初三M7-8复习", "升初三M9-10复习", "初三上M1part1", "初三上M1part2",
						"初三上M2part1", "初三上M2part2", "初三上M3part1"
					]
				}, {
					"subject": "物理",
					"detail": ["分子热运动", "内能", "比热容", "热机", "热机效率及能量守恒定律", "热学复习", "两种电荷", "电流与电路", "串联和并联", "电流的测量"]
				}, {
					"subject": "化学",
					"detail": ["绪论、物质的变化与性质", "化学研究实验", "走进实验室", "空气", "氧气", "制取氧气", "分子与原子", "原子的结构", "元素", "爱护水资源与水的净化"]
				}]
			}]
		}, {
			"name": "gz",
			"detail": [{
				"grade": "高一",
				"tc": "升高一",
				"title": "2019年星火某学员升高一暑假教案计划",
				"centent": [{
					"subject": "数学",
					"detail": ["不等式的解法", "因式分解", "二次函数、一元二次方程", "集合的含义及表示", "集合间的基本关系", "集合的基本运算", "函数的概念", "函数的表示方法", "分段函数",
						"函数的单调性"
					]
				}, {
					"subject": "英语",
					"detail": ["第一单元第一课重点词汇句型精讲", "第一单元第二课重点词汇句型精讲", "第一单元第三课重点词汇句型精讲", "第一单元第四课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲",
						"第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "第二单元第一课重点词汇句型精讲", "详细讲解句子中的成分", "定语从句的定义，用法及连接词种类"
					]
				}, {
					"subject": "物理",
					"detail": ["运动的描述", "运动的快慢", "加速度", "速度与时间的关系", "位移与时间的关系", "位移与速度的关系", "追及相遇问题", "自由落体运动", "打点计时器的应用",
						"运动学复习"
					]
				}, {
					"subject": "化学",
					"detail": ["化学实验", "物质的量", "溶液配制", "物质的分类", "离子反应1", "离子反应2", "氧化还原1", "氧化还原2", "氧化还原3", "金属单质性质"]
				}]
			}, {
				"grade": "高二",
				"tc": "升高二",
				"title": "2019年星火某学员升高二暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之图文转换", "基础之病句", "文言文阅读之实词推断", "文言文阅读之虚词理解", "文言文阅读之句式", "文言文阅读之内容理解", "古诗词鉴赏之常见诗歌题材",
						"古诗词鉴赏之理解意象与意境", "古诗词鉴赏之修辞手法", "散文阅读之分析散文结构，把握主旨"
					]
				}, {
					"subject": "数学",
					"detail": ["平面向量", "解三角形", "等差数列和等比数列的概念及性质", "数列求和", "空间集几何体的结构特征", "空间几何体的三视图与直观图", "空间几何体的表面积与体积",
						"空间点、线、面的位置关系", "直线、平面平行的判定", "直线、平面平行的性质"
					]
				}, {
					"subject": "英语",
					"detail": ["升高二Unit6复习", "升高二Unit7复习", "升高二Unit8 复习", "升高二Unit9 复习", "升高二Unit10 复习",
						"Unit11 Warm­up&lesson 1", "Unit11 lesson 2 &lesson 3", "unit11 lesson 4&commnication workshop",
						"unit 12 warm-up&lesson 1", "unit12 lesson 2 & lesson 3"
					]
				}, {
					"subject": "物理",
					"detail": ["运动学复习", "受力分析（上）", "受力分析（下）", "牛顿运动定律", "动力学两类问题", "平抛运动和圆周运动", "天体运动", "功能关系", "静电力和库仑定律",
						"电场和电场强度"
					]
				}, {
					"subject": "化学",
					"detail": ["元素周期律复习", "化学键复习", "有机复习", "海水工业复习", "化学反应与能量", "盖斯定律", "化学反应速率", "化学平衡", "平衡影响因素", "平衡常数"]
				}]
			}, {
				"grade": "高三",
				"tc": "升高三",
				"title": "2019年星火某学员升高三暑假教案计划",
				"centent": [{
					"subject": "语文",
					"detail": ["基础之语言得体", "基础之病句", "基础之补写句子", "文言文阅读之断句", "文言文阅读之层次把握、内容理解", "文言文阅读之翻译句子",
						"文言文阅读之常见的文化常识考查类型", "小说阅读之标题的含义与作用", "小说阅读之常见的写作手法", "小说阅读之分析段落的意蕴和作用"
					]
				}, {
					"subject": "数学",
					"detail": ["集合的概念与运算", "命题及其关系、充分条件、必要条件", "简单的逻辑联结词，全称命题、存在命题", "函数的概念", "函数的基本性质", "指数与指数函数", "对数与对数函数",
						"二次函数与幂函数", "函数的图象", "函数与方程"
					]
				}, {
					"subject": "英语",
					"detail": ["语法专题：句子成分", "语法专题：定语从句", "语法专题：名词性从句", "语法专题：状语从句", "语法专题：时态", "语法专题：非谓语动词", "语法专题：非谓语动词",
						"语法专题：长难句", "语法专题：介词", "写作专题：如何写好基本句型"
					]
				}, {
					"subject": "物理",
					"detail": ["受力分析及其方法", "匀变速直线运动规律", "牛顿运动定律", "抛体运动及圆周运动", "天体运动", "动能定律", "机械能守恒及能量守恒", "动量定理",
						"动量守恒及碰撞模型", "力学实验专题"
					]
				}, {
					"subject": "化学",
					"detail": ["化学计量数", "分散系与离子反应", "氧化还原反应", "钠及其化合物", "镁铝及其化合物", "铁铜及其化合物", "硅及其化合物", "氯及其化合物", "硫及其化合物",
						"氮及其化合物"
					]
				}]
			}]
		}]
	}]
}
